IDEA StatiCa Open Model
ConnectionSetup.EffectiveAreaStressCoeff Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Effective area is taken from intersection of stress area and area of joined items according to EN1993-1-8 art. 6.2.5
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double EffectiveAreaStressCoeff { get; set; }
Public Property EffectiveAreaStressCoeff As Double
	Get
	Set
public:
property double EffectiveAreaStressCoeff {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace